diamond-draft_mach3/system/blockMeshDict
// nx = [ 20 10 20 15 10 15 ]
// ex = [ 2 1 2 3 5 3 ]
// c = 0.5
// t = 0.4
// d = 0.4
// fac = 1
// H = 4
// Lf = 4
// Lw = 6
// n = 8
// Airfoil type is diamond
 
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}
 
convertToMeter = 1.0;
 
vertices
(
     ( 0.5 0 -0.05 ) //0
     ( 0.25 0.2 -0.05 ) //1
     ( 0 0.4 -0.05 ) //2
     ( -0.25 0.2 -0.05 ) //3
     ( -0.5 0 -0.05 ) //4
     ( -0.25 -0.2 -0.05 ) //5
     ( 0 -0.4 -0.05 ) //6
     ( 0.25 -0.2 -0.05 ) //7
     ( 1 0 -0.05 ) //8
     ( 0.68836 0.65283 -0.05 ) //9
     ( 0 0.9 -0.05 ) //10
     ( -0.68826 0.65292 -0.05 ) //11
     ( -1 0 -0.05 ) //12
     ( -0.68826 -0.65292 -0.05 ) //13
     ( 0 -0.9 -0.05 ) //14
     ( 0.68836 -0.65283 -0.05 ) //15
     ( 6 0 -0.05 ) //16
     ( 6 0.65283 -0.05 ) //17
     ( 6 4 -0.05 ) //18
     ( 0.68836 4 -0.05 ) //19
     ( 0 4 -0.05 ) //20
     ( -0.68826 4 -0.05 ) //21
     ( -4 4 -0.05 ) //22
     ( -4 0.65292 -0.05 ) //23
     ( -4 0 -0.05 ) //24
     ( -4 -0.65292 -0.05 ) //25
     ( -4 -4 -0.05 ) //26
     ( -0.68826 -4 -0.05 ) //27
     ( 0 -4 -0.05 ) //28
     ( 0.68836 -4 -0.05 ) //29
     ( 6 -4 -0.05 ) //30
     ( 6 -0.65283 -0.05 ) //31
     ( 0.5 0 0.05 ) //32
     ( 0.25 0.2 0.05 ) //33
     ( 0 0.4 0.05 ) //34
     ( -0.25 0.2 0.05 ) //35
     ( -0.5 0 0.05 ) //36
     ( -0.25 -0.2 0.05 ) //37
     ( 0 -0.4 0.05 ) //38
     ( 0.25 -0.2 0.05 ) //39
     ( 1 0 0.05 ) //40
     ( 0.68836 0.65283 0.05 ) //41
     ( 0 0.9 0.05 ) //42
     ( -0.68826 0.65292 0.05 ) //43
     ( -1 0 0.05 ) //44
     ( -0.68826 -0.65292 0.05 ) //45
     ( 0 -0.9 0.05 ) //46
     ( 0.68836 -0.65283 0.05 ) //47
     ( 6 0 0.05 ) //48
     ( 6 0.65283 0.05 ) //49
     ( 6 4 0.05 ) //50
     ( 0.68836 4 0.05 ) //51
     ( 0 4 0.05 ) //52
     ( -0.68826 4 0.05 ) //53
     ( -4 4 0.05 ) //54
     ( -4 0.65292 0.05 ) //55
     ( -4 0 0.05 ) //56
     ( -4 -0.65292 0.05 ) //57
     ( -4 -4 0.05 ) //58
     ( -0.68826 -4 0.05 ) //59
     ( 0 -4 0.05 ) //60
     ( 0.68836 -4 0.05 ) //61
     ( 6 -4 0.05 ) //62
     ( 6 -0.65283 0.05 ) //63
);
 
blocks
(
     //block 0
     hex (0 8 9 1 32 40 41 33) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 1
     hex (1 9 10 2 33 41 42 34) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 2
     hex (2 10 11 3 34 42 43 35) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 3
     hex (3 11 12 4 35 43 44 36) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 4
     hex (4 12 13 5 36 44 45 37) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 5
     hex (5 13 14 6 37 45 46 38) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 6
     hex (6 14 15 7 38 46 47 39) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 7
     hex (7 15 8 0 39 47 40 32) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 8
     hex (8 16 17 9 40 48 49 41) ( 20 10 1) simpleGrading ( 2 1 1)
     //block 9
     hex (9 17 18 19 41 49 50 51) ( 20 15 1) simpleGrading ( 2 3 1)
     //block 10
     hex (9 19 20 10 41 51 52 42) ( 15 10 1) simpleGrading ( 3 1 1)
     //block 11
     hex (10 20 21 11 42 52 53 43) ( 15 10 1) simpleGrading ( 3 1 1)
     //block 12
     hex (11 21 22 23 43 53 54 55) ( 15 10 1) simpleGrading ( 3 5 1)
     //block 13
     hex (11 23 24 12 43 55 56 44) ( 10 10 1) simpleGrading ( 5 1 1)
     //block 14
     hex (12 24 25 13 44 56 57 45) ( 10 10 1) simpleGrading ( 5 1 1)
     //block 15
     hex (13 25 26 27 45 57 58 59) ( 10 15 1) simpleGrading ( 5 3 1)
     //block 16
     hex (13 27 28 14 45 59 60 46) ( 15 10 1) simpleGrading ( 3 1 1)
     //block 17
     hex (14 28 29 15 46 60 61 47) ( 15 10 1) simpleGrading ( 3 1 1)
     //block 18
     hex (15 29 30 31 47 61 62 63) ( 15 20 1) simpleGrading ( 3 2 1)
     //block 19
     hex (15 31 16 8 47 63 48 40) ( 20 10 1) simpleGrading ( 2 1 1)
);
 
edges
(
     arc 8 9 ( 0.91623 0.36058 -0.05 )
     arc 40 41 ( 0.91623 0.36058 0.05 )
     arc 9 10 ( 0.36625 0.83746 -0.05 )
     arc 41 42 ( 0.36625 0.83746 0.05 )
     arc 10 11 ( -0.36619 0.83749 -0.05 )
     arc 42 43 ( -0.36619 0.83749 0.05 )
     arc 11 12 ( -0.9162 0.36064 -0.05 )
     arc 43 44 ( -0.9162 0.36064 0.05 )
     arc 12 13 ( -0.9162 -0.36064 -0.05 )
     arc 44 45 ( -0.9162 -0.36064 0.05 )
     arc 13 14 ( -0.36619 -0.83749 -0.05 )
     arc 45 46 ( -0.36619 -0.83749 0.05 )
     arc 14 15 ( 0.36625 -0.83746 -0.05 )
     arc 46 47 ( 0.36625 -0.83746 0.05 )
     arc 15 8 ( 0.91623 -0.36058 -0.05 )
     arc 47 40 ( 0.91623 -0.36058 0.05 )
 
);
 
boundary
( 
   inlet
   {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
       );
   }
   outlet
   {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)
       );
   }
   airfoil
   {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
       );
   }
   top
   {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
       );
   }
   bottom
   {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
       );
   }
);